Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `quarkus.kubernetes.env-vars` are deprecated (though still currently supported as of this writing) and the new declaration style should be used instead. See xref:env-vars[Environment variables] and more specifically xref:env-vars-backwards[Backwards compatibility] for more details.
ja_jp: `quarkus.kubernetes.env-vars` は非推奨であり（この記事を書いている時点ではまだサポートされていますが）、代わりに新しい宣言スタイルを使用する必要があります。詳しくは xref:env-vars[環境変数] と xref:env-vars-backwards[後方互換性] をご覧ください。

source: `quarkus.log.file.rotation.max-file-size` is now set to 10 MB by default.
ja_jp: `quarkus.log.file.rotation.max-file-size` は、デフォルトで10MBに設定されるようになりました。

source: `quarkus.lra.devservices.enabled` is set to `false`
ja_jp: `quarkus.lra.devservices.enabled` が `false` に設定されている

source: `quarkus.mailer.trust-store.type` is optional and allows configuring the type of trust store (among `JKS`, `PEM` and `PCKS`). When not set, Quarkus tries to deduce the type from the file name.
ja_jp: `quarkus.mailer.trust-store.type` はオプションで、trust storeのタイプを設定できます（ `JKS` 、 `PEM` 、 `PCKS` の中から選択）。設定されていない場合、Quarkusはファイル名からタイプを推測しようとします。

source: `quarkus.mailer.trust-store.type` is optional and allows configuring the type of trust store (among `JKS`, `PEM` and `PKCS`). When not set, Quarkus tries to deduce the type from the file name.
ja_jp: `quarkus.mailer.trust-store.type` はオプションで、トラストストアのタイプを設定できます（ `JKS` 、 `PEM` 、 `PCKS` の中から選択）。設定されていない場合、Quarkusはファイル名からタイプを推測しようとします。

source: `quarkus.management.host` - the interface / host
ja_jp: `quarkus.management.host` - インターフェイス／ホスト

source: `quarkus.management.port` - the port
ja_jp: `quarkus.management.port` - ポート

source: `quarkus.management.ssl` - the TLS configuration, xref:http-reference#ssl[same as for the main HTTP server].
ja_jp: `quarkus.management.ssl` - xref:http-reference.adoc#ssl[メインのHTTPサーバーと同様] の、TLSの設定

source: `quarkus.management.test-port` - the port to use in test mode
ja_jp: `quarkus.management.test-port` - テストモードで使用するポート

source: `quarkus.management.tls-configuration-name` - the TLS configuration name, xref:http-reference.adoc#using-the-tls-centralized-configuration[same as for the main HTTP server].
ja_jp: `quarkus.management.tls-configuration-name` - TLS 設定名、xref:http-reference.adoc#using-the-tls-centralized-configuration[メイン HTTP サーバーの場合と同じ]。

source: `quarkus.messaging.message.acks` : The number of messages processed successfully
ja_jp: `quarkus.messaging.message.acks` : 正常に処理されたメッセージの数

source: `quarkus.messaging.message.count` : The number of messages produced or received
ja_jp: `quarkus.messaging.message.count` : 生成または受信したメッセージの数

source: `quarkus.messaging.message.duration` : The duration of the message processing
ja_jp: `quarkus.messaging.message.duration` : メッセージの処理時間

source: `quarkus.messaging.message.duration` : The duration of the message processing.
ja_jp: `quarkus.messaging.message.duration`: メッセージの処理時間

source: `quarkus.messaging.message.failures` : The number of messages processed with failures
ja_jp: `quarkus.messaging.message.failures` : 処理に失敗したメッセージの数

source: `quarkus.micrometer.export.prometheus.path` - The location of the micrometer metrics endpoint.
ja_jp: `quarkus.micrometer.export.prometheus.path` - Micrometerメトリクスのエンドポイントの場所。

source: `quarkus.native.container-build=true` allows for creating a Linux executable without GraalVM being installed (and is only necessary if you don't have GraalVM installed locally or your local operating system is not Linux)
ja_jp: `quarkus.native.container-build=true` では GraalVM がインストールされていなくても Linux の実行可能ファイルを作成することができます(ローカルに GraalVM がインストールされていない場合や、ローカルのオペレーティングシステムが Linux ではない場合にのみ必要です)。

source: `quarkus.oidc.TokenCertificateValidator` can be used to add a custom certificate chain validation step. It can be used by all tenants expecting tokens with the certificate chain or bound to specific OIDC tenants with the `@quarkus.oidc.TenantFeature` annotation.
ja_jp: `quarkus.oidc.TokenCertificateValidator` を使用すると、カスタム証明書チェーン検証手順を追加できます。これは、証明書チェーンを持つトークンを要求するすべてのテナント、または `@quarkus.oidc.TenantFeature` アノテーションを使用して特定の OIDC テナントにバインドされたすべてのテナントで使用できます。

source: `quarkus.oidc.allow-token-introspection-cache` and `quarkus.oidc.allow-user-info-cache` can be used to enable caching token introspection and UserInfo results respectively on a `per OIDC tenant` basis.
ja_jp: `quarkus.oidc.allow-token-introspection-cache` と `quarkus.oidc.allow-user-info-cache` を使用して、 `OIDC テナント単位` でトークンイントロスペクションと UserInfo 結果のキャッシュをそれぞれ有効にできます。

source: `quarkus.oidc.auth-server-url` is a key base OIDC URL property.
ja_jp: `quarkus.oidc.auth-server-url` は、主要なベース OIDC URL プロパティーです。

source: `quarkus.oidc.auth-server-url` is a key base OIDC URL property. By default, Quarkus OIDC adds a `.well-known/openid-configuration` path segment to this URL and discovers the OIDC provider metadata.
ja_jp: `quarkus.oidc.auth-server-url` は、ベースとなる主要な OIDC URL プロパティーです。デフォルトでは、 Quarkus OIDC はこの URL に `.well-known/openid-configuration` パスセグメントを追加し、 OIDC プロバイダーのメタデータを検出します。

source: `quarkus.oidc.auth-server-url`, which points to the running test container.
ja_jp: 実行中のテストコンテナーを指す `quarkus.oidc.auth-server-url`

source: `quarkus.oidc.authentication.allow-multiple-code-flows` allows multi-tab authentication by default. For example, a user starts an authorization code flow in one tab, is about to enter the requested credentials, does not complete it because of some interruption, later opens another tab and starts and completes another authorization code flow, with the original one still pending in the first tab. Now, the already authenticated user returns to the first tab and completes it as well. If this kind of authentication flow flexibility is considered too much for the stricter authentication policies you may have, set `quarkus.oidc.authentication.allow-multiple-code-flows=false`. See also the `quarkus.oidc.authentication.fail-on-missing-kid` property description below.
ja_jp: `quarkus.oidc.authentication.allow-multiple-code-flows` はデフォルトでマルチタブ認証を許可します。たとえば、ユーザーがあるタブで認可コードフローを開始し、要求されたクレデンシャルを入力しようとしている最中に、何らかの中断で完了せず、後に別のタブを開いて別の認可コードフローを開始・完了させたとしても、最初のタブでの元のフローは保留状態のまま残ります。この時、すでに認証済みのユーザーが最初のタブに戻ってそのフローも完了させることができます。このような認証フローの柔軟性が、より厳格な認証ポリシーにとって過剰であると判断される場合は、 `quarkus.oidc.authentication.allow-multiple-code-flows=false` を設定してください。以下の `quarkus.oidc.authentication.fail-on-missing-kid` 設定プロパティーの説明も参照してください。

source: `quarkus.oidc.authentication.cookie-force-secure` may only be relevant in some deployments if Quarkus is listening on non-secure HTTP protocol but running behind HTTPS terminating reverse proxy. This property has no impact if Quarkus is listening on HTTPS, when cookies are always secure.
ja_jp: `quarkus.oidc.authentication.cookie-force-secure` は、Quarkus がセキュアでない HTTP プロトコルでリッスンしているが、HTTPS を終端するリバースプロキシの背後で動作している一部のデプロイメントにおいてのみ関係する可能性があります。Quarkus が HTTPS でリッスンしている場合、Cookie は常にセキュアであるため、このプロパティーの影響はありません。

source: `quarkus.oidc.authentication.cookie-path-header` can be used to dynamically set the required cookie path - this property should be used with care and only when it fits your deployment requirements.
ja_jp: `quarkus.oidc.authentication.cookie-path-header` を使用すると、必要な Cookie パスを動的に設定できます。このプロパティーは慎重に、かつデプロイメントの要件に適合する場合にのみ使用してください。

source: `quarkus.oidc.authentication.cookie-path` and `quarkus.oidc.authentication.cookie-domain` properties control which application paths the state and session cookies will be available at. The wider the cookie-path is ("/"), the wider the application secured space can be. You may want to restrict it to more specific paths such as `/secured`, to make it easier to handle the public space available at paths such as `/public`. You may also want to restrict it when the specific endpoint paths should only be accessible by users who authenticated with specific providers only. For example, `/keycloak` path can only accessible by users authenticated with Keycloak, `/google` - with Google, etc. See also the <<multi-tenancy>> section for more information.
ja_jp: `quarkus.oidc.authentication.cookie-path` および `quarkus.oidc.authentication.cookie-domain` プロパティーは、State Cookie およびセッション Cookie がどのアプリケーションパスで利用可能になるかを制御します。Cookie パスが広いほど ("/")、アプリケーションの保護されるスペースを広くできます。 `/public` などのパスで利用可能な公開スペースを扱いやすくするために、これを `/secured` などのより具体的なパスに制限したい場合があります。また、特定のエンドポイントパスが、特定のプロバイダーで認証されたユーザーのみにアクセス可能であるべき場合にも制限したい場合があります。たとえば、 `/keycloak` パスは Keycloak で認証されたユーザーのみ、 `/google` は Google で認証されたユーザーのみがアクセスできるようにします。詳細は <<multi-tenancy>> セクションを参照してください。

source: `quarkus.oidc.authentication.cookie-path` is set to `/` by default but can be narrowed to the more specific root path such as `/web-app`.
ja_jp: `quarkus.oidc.authentication.cookie-path` は、デフォルトでは `/` に設定されていますが、 `/web-app` のように、より具体的なルートパスに絞り込むことができます。

source: `quarkus.oidc.authentication.cookie-path` property is used to ensure the cookies are visible especially when you access the protected resources with overlapping or different roots, for example:
ja_jp: `quarkus.oidc.authentication.cookie-path` プロパティーは、特にルートが重複または異なる保護されたリソースにアクセスするときに Cookie が表示されるようにするために使用されます。次に例を示します。

source: `quarkus.oidc.authentication.cookie-same-site` defines a `Same-Site` attribute for a session cookie as `lax` by default, since setting it to `strict` proved to be breaking some deployments. However, setting it to `strict` is RECOMMENDED when it is known to work in your deployment, for example, when the OIDC provider is hosted in the same domain as the application, etc.
ja_jp: `quarkus.oidc.authentication.cookie-same-site` は、セッション Cookie の `Same-Site` 属性をデフォルトで `lax` と定義しています。これは、 `strict` に設定すると一部のデプロイメントで不具合が生じることが判明しているためです。ただし、OIDC プロバイダーがアプリケーションと同じドメインでホストされている場合など、デプロイメントで正常に動作することがわかっている場合は、 `strict` に設定することが推奨されます。

source: `quarkus.oidc.authentication.cookie-suffix` can be used to customize the state and session cookie names. For example, by setting `%test.quarkus.oidc.authentication.cookie-suffix=test` you can have the session cookie name qualified with the `_test` suffix in the test profile only.
ja_jp: `quarkus.oidc.authentication.cookie-suffix` を使用して、State Cookie とセッション Cookie の名前をカスタマイズできます。たとえば、 `%test.quarkus.oidc.authentication.cookie-suffix=test` と設定することで、テストプロファイルにおいてのみセッション Cookie 名に `_test` サフィックスを付加できます。

source: `quarkus.oidc.authentication.fail-on-missing-kid` property is related to the mult-tab authentication. It can happen that the session's ID token signature can no longer be verified because the authentication in another tab caused a verification key refresh, and the key identifier for the current ID token can no longer be found, causing HTTP `401`. To request the user re-authentication instead, you may want to set this property to `false`. It is set to `true` by default to stress that a situation where a token's signature can not be verified should be treated with care.
ja_jp: `quarkus.oidc.authentication.fail-on-missing-kid` プロパティーは、マルチタブ認証に関連しています。別のタブでの認証によって検証キーのリフレッシュが発生し、現在の ID トークンのキー識別子が見つからなくなったために、セッションの ID トークン署名が検証できなくなり、HTTP `401` が発生することがあります。代わりにユーザーに再認証を求める場合は、このプロパティーを `false` に設定するとよいでしょう。トークンの署名が検証できない状況は慎重に扱うべきであることを強調するため、デフォルトは `true` に設定されています。

source: `quarkus.oidc.authentication.fail-on-missing-state-param=true` does not relax the security, it is primarily about the user experience: if, for whatever reasons, the authorization code flow can not be completed due to a misssing `state` query parameter, the user is redirected to the OIDC provider to re-authenticate, rather than returning a blank HTTP 401 response to the user.
ja_jp: `quarkus.oidc.authentication.fail-on-missing-state-param=true` は、セキュリティーを緩和するものではなく、主にユーザー体験に関するものです。何らかの理由で `state` クエリーパラメーターが欠落しているために認可コードフローを完了できない場合、ユーザーに何も表示されない HTTP 401 レスポンスを返すのではなく、再認証のために OIDC プロバイダーにリダイレクトします。

source: `quarkus.oidc.authentication.fail-on-missing-state-param` is about controlling what should happen when the state cookie is detected, thus indicating that the first leg of the authorization code flow is about to be completed, but no matching `state` query parameter is found in what is expected a return redirect from the OIDC provider to Quarkus OIDC. This property is set to `false` by default because it is the case with a multi-tab authentication, where a state cookie related to one tab is available but the current request represents a new tab authentication request (see also the `quarkus.oidc.authentication.allow-multiple-code-flows` property description in the <<authorization-code-flow-initiation>> section above). It also makes it much easier to develop and test OIDC secured endpoints, since otherwise, trying to access Quarkus again after the failed or abandoned authentication attempts at the OIDC provider site can cause difficult to explain HTTP 401 status errors due to the loose state cookies, requiring cleaning the browser cache.
ja_jp: `quarkus.oidc.authentication.fail-on-missing-state-param` は、State Cookie が検出され (これにより、認可コードフローの最初の段階が完了しようとしていることを示唆します)、かつ OIDC プロバイダーから Quarkus OIDC への戻りリダイレクトにおいて、一致する `state` クエリーパラメーターが見つからない場合に何が起きるべきかを制御するためのものです。 このプロパティーはデフォルトで `false` に設定されています。これは、あるタブに関連する State Cookie が存在するものの、現在のリクエストが新しいタブの認証リクエストであるようなマルチタブ認証のケースがあるためです (上記の <<authorization-code-flow-initiation>> セクションにある `quarkus.oidc.authentication.allow-multiple-code-flows` プロパティーの説明も参照してください)。 また、OIDC プロバイダー側での認証試行に失敗したり中断したりした後、再度 Quarkus にアクセスしようとした際に、残存している State Cookie が原因で説明が難しい HTTP 401 ステータスエラーが発生し、ブラウザーキャッシュのクリアが必要になる事態を回避できるため、OIDC で保護されたエンドポイントの開発とテストがはるかに容易になります。

source: `quarkus.oidc.authentication.force-redirect-https-scheme` can be used to build a correct redirect URI when the original user request is made over HTTPS but the firewall terminates it and Quarkus sees the `http://` scheme. By setting `quarkus.oidc.authentication.force-redirect-https-scheme=true`, you tell Quarkus to use the `https://` scheme, even when Quarkus OIDC sees the `http://` scheme in the current request URL, to ensure the user is correctly redirected to the HTTPS based OIDC authorization endpoint. Setting this property may not be necessary if you already enabled Quarkus to recognize adoc:http-reference#reverse-proxy[Forwarded or X-Forwarded headers].
ja_jp: `quarkus.oidc.authentication.force-redirect-https-scheme` は、元のユーザーリクエストが HTTPS 経由で行われたものの、ファイアウォールで終端され Quarkus には `http://` スキームとして見える場合に、正しいリダイレクト URI を構築するために使用できます。 `quarkus.oidc.authentication.force-redirect-https-scheme=true` を設定することで、Quarkus OIDC が現在のリクエスト URL で `http://` スキームを検知した場合でも、 `https://` スキームを使用するように Quarkus に指示し、ユーザーを HTTPS ベースの OIDC 認可エンドポイントに正しくリダイレクトさせることができます。 adoc:http-reference#reverse-proxy[Forwarded または X-Forwarded ヘッダー] を認識するように Quarkus を設定済みの場合は、このプロパティーの設定は不要な場合があります。

source: `quarkus.oidc.authentication.force-redirect-https-scheme` property can also be used when the Quarkus application is running behind an SSL terminating reverse proxy.
ja_jp: `quarkus.oidc.authentication.force-redirect-https-scheme` プロパティーは、Quarkus アプリケーションが SSL 終了リバースプロキシーの背後で実行されている場合にも使用できます。

source: `quarkus.oidc.authentication.force-redirect-https-scheme` property can also be used when the Quarkus application is running behind an SSL-terminating reverse proxy.
ja_jp: `quarkus.oidc.authentication.force-redirect-https-scheme` プロパティーは、Quarkus アプリケーションが SSL 終了リバースプロキシーの背後で実行されている場合にも使用できます。

source: `quarkus.oidc.authentication.force-redirect-https-scheme` property may also be used when the Quarkus application is running behind a SSL terminating reverse proxy.
ja_jp: `quarkus.oidc.authentication.force-redirect-https-scheme` プロパティーは、QuarkusアプリケーションがSSL終端リバースプロキシーの後ろで実行されている場合にも使用できます。

source: `quarkus.oidc.authentication.force-redirect-https-scheme` property may also be used when the Quarkus application is running behind an SSL terminating reverse proxy.
ja_jp: `quarkus.oidc.authentication.force-redirect-https-scheme` プロパティーは、QuarkusアプリケーションがSSL終端リバースプロキシーの後ろで実行されている場合にも使用できます。

source: `quarkus.oidc.authentication.nonce-required` is an authorization code flow security hardening property that can prevent replay attacks. If Quarkus is asked to generate it and include a `nonce=<generated_nonce>` query parameter during an initial authentication redirect, the OIDC provider must return an ID token which includes a `nonce` claim with a matching `nonce` value. It is set to `false` by default because it is not guaranteed to be supported by default by all OIDC and especially OAuth2 providers. Setting this property to `true` is `RECOMMENDED` if your provider supports this feature.
ja_jp: `quarkus.oidc.authentication.nonce-required` は、リプレイアタックを防止できる認可コードフローのセキュリティー強化プロパティーです。Quarkus がこれを生成し、初期認証リダイレクト中に `nonce=<generated_nonce>` クエリーパラメーターを含めるように求められた場合、OIDC プロバイダーは、一致する `nonce` 値を持つ `nonce` クレームを含む ID トークンを返さなければなりません。すべての OIDC プロバイダー、特に OAuth2 プロバイダーがデフォルトでこれをサポートしているとは限らないため、デフォルトでは `false` に設定されています。プロバイダーがこの機能をサポートしている場合は、このプロパティーを `true` に設定することが `RECOMMENDED` です。

source: `quarkus.oidc.authentication.pkce-required` can be used to enable https://www.rfc-editor.org/rfc/rfc7636[Proof Key for Code Exchange (PKCE)]. PKCE is of primary interest to public SPA OIDC clients running in a browser. Typically, Quarkus OIDC acts as a confidential OIDC client which can prove to the OIDC provider that it knows the client secret, when PKCE is not strictly necessary. However you may have to enable it when your provider enforces PKCE for all authorization code flow clients.
ja_jp: `quarkus.oidc.authentication.pkce-required` を使用して、 https://www.rfc-editor.org/rfc/rfc7636[Proof Key for Code Exchange (PKCE)] を有効にできます。 PKCE は、主にブラウザーで実行されるパブリックな SPA OIDC クライアントにとって重要です。通常、Quarkus OIDC は、クライアントシークレットを知っていることを OIDC プロバイダーに証明できる機密性の高い OIDC クライアントとして動作するため、PKCE は厳密には必要ありません。ただし、プロバイダーがすべての認可コードフロークライアントに対して PKCE を強制する場合は、これを有効にする必要があるかもしれません。

source: `quarkus.oidc.authentication.rar.array` property can be used to add array fields to the authorization details JSON.
ja_jp: `quarkus.oidc.authentication.rar.array` 設定プロパティーを使用すると、認可詳細の JSON に配列フィールドを追加できます。

source: `quarkus.oidc.authentication.rar.simple` property can be used to add simple string fields to the authorization details JSON.
ja_jp: `quarkus.oidc.authentication.rar.simple` 設定プロパティーを使用すると、認可詳細の JSON に単純な文字列フィールドを追加できます。

source: `quarkus.oidc.authentication.rar.type` is a required property that specifies the authorization details type. This type identifies the kind of authorization being requested, such as `openid_credential` for verifiable credentials.
ja_jp: `quarkus.oidc.authentication.rar.type` は、認可詳細のタイプを指定する必須の設定プロパティーです。このタイプは、検証可能なクレデンシャル用の `openid_credential` のように、リクエストされている認可の種類を識別します。

source: `quarkus.oidc.authentication.redirect-path` relative path points to the Quarkus endpoint where the user is redirected to by OIDC provider, after the user completed the authentication challenge. The absolute address of this endpoint is the one you set during the OIDC application registration as a callback URL. For example, if the Quarkus endpoint is running at `https://myservice.com` and you have the `quarkus.oidc.authentication.redirect-path=service` redirect path then `https://myservice.com/service` is an absolute callback URL.
ja_jp: `quarkus.oidc.authentication.redirect-path` 相対パスは、ユーザーが認証チャレンジを完了した後に、OIDC プロバイダーによってリダイレクトされる Quarkus エンドポイントを指します。このエンドポイントの絶対アドレスは、OIDC アプリケーション登録時にコールバック URL として設定したものです。たとえば、Quarkus エンドポイントが `https://myservice.com` で動作しており、 `quarkus.oidc.authentication.redirect-path=service` というリダイレクトパスがある場合、絶対コールバック URL は `https://myservice.com/service` になります。

source: `quarkus.oidc.authentication.remove-redirect-parameters` forces an additional redirect after the authenticated user got redirected to Quarkus and the authorization code got exchanged for tokens and a session was established. This is done to drop the authorization code flow specific properties such as `code` and `state` from the URL, which, if the application does not follow with its own redirects, may remain visible in the browser as URL query parameters. Note though that the `code` is a one time token that can only be exchanged by Quarkus OIDC which knows the client credentials required to complete the authorization code flow. However, in general, dropping these is RECOMMENDED and should be done by default.
ja_jp: `quarkus.oidc.authentication.remove-redirect-parameters` は、認証済みユーザーが Quarkus にリダイレクトされ、認可コードがトークンと交換され、セッションが確立された後に、追加のリダイレクトを強制します。これは、URL から `code` や `state` などの認可コードフロー固有の設定プロパティーを削除するために行われます。アプリケーションが独自のリダイレクトを行わない場合、これらの設定プロパティーは URL クエリーパラメーターとしてブラウザーに表示されたままになる可能性があります。ただし、 `code` は、認可コードフローを完了するために必要なクライアントクレデンシャルを知っている Quarkus OIDC のみが交換できるワンタイムトークンであることに注意してください。しかし一般的には、これらを削除することが推奨され、デフォルトで行われるべきです。

source: `quarkus.oidc.authentication.response-mode` defines how the OIDC provider returns the authorization code flow properties such as `code`. Usually, these parameters are returned as query parameters, for example, `https://myservice.com/service?code=somecode&state=somestate`. It is a `query` response mode which is supported by default.
ja_jp: `quarkus.oidc.authentication.response-mode` は、OIDC プロバイダーが `code` などの認可コードフローのプロパティーをどのように返すかを定義します。通常、これらのパラメーターはクエリーパラメーターとして返されます (例: `https://myservice.com/service?code=somecode&state=somestate`)。これは `query` レスポンスモードであり、デフォルトでサポートされています。

source: `quarkus.oidc.authentication.restore-path-after-redirect` can be used to restore the original request path which was used to initiate the authorization code flow. For example, let's assume your application provides a lot of endpoints that require a secured access, and registering all possible initial secure Quarkus endpoint URLs as OIDC callback URLs is not possible. In such cases, `quarkus.oidc.authentication.restore-path-after-redirect=true` can be set to get Quarkus OIDC redirect the authenticated user to the original request URL after this user was returned to the callback URL configured with `quarkus.oidc.authenticaion.redirect-path`. In this case, the callback URL is expected to be virtual, there is no need to allocate a JAX-RS callback endpoint to support it.
ja_jp: `quarkus.oidc.authentication.restore-path-after-redirect` を使用すると、認可コードフローを開始するために使用された元のリクエストパスを復元できます。たとえば、アプリケーションがセキュアなアクセスを必要とする多くのエンドポイントを提供しており、考えられるすべての初期セキュア Quarkus エンドポイント URL を OIDC コールバック URL として登録することが不可能な場合を想定します。このような場合、 `quarkus.oidc.authentication.restore-path-after-redirect=true` を設定することで、 `quarkus.oidc.authenticaion.redirect-path` で設定されたコールバック URL に戻ってきた認証済みユーザーを、Quarkus OIDC に元のリクエスト URL へリダイレクトさせることができます。この場合、コールバック URL は仮想的なものとして扱われるため、それをサポートするための JAX-RS コールバックエンドポイントを割り当てる必要はありません。

source: `quarkus.oidc.authentication.session-expired-path` can be used to present the user whose session has expired with the page explaining that the session has expired and letting user follow a link to re-authenticate. It improves the user experience, since otherwise, the authenticated user, whose session has expired, may get surprised after getting an unexpected OIDC provider's authentication challenge screen, when accessing the Quarkus application, following some delay after successfully authenticating earlier.
ja_jp: `quarkus.oidc.authentication.session-expired-path` を使用すると、セッションが期限切れになったユーザーに対して、セッションが期限切れであることを説明し、再認証のためのリンクを提示するページを表示できます。これにより、以前の認証成功からしばらく経って Quarkus アプリケーションにアクセスした際に、予期せぬ OIDC プロバイダーの認証画面が表示されてユーザーが驚くといった状況を避け、ユーザー体験を向上させることができます。

source: `quarkus.oidc.authentication.state-cookie-age` defines a state cookie lifespan.
ja_jp: `quarkus.oidc.authentication.state-cookie-age` は、State Cookie の有効期間を定義します。

source: `quarkus.oidc.authentication.user-info-required` can be used to enable an additional remote `UserInfo` request.
ja_jp: `quarkus.oidc.authentication.user-info-required` を使用して、追加のリモート `UserInfo` リクエストを有効にできます。

source: `quarkus.oidc.authentication.user-info-required` is automatically enabled if one of these conditions is met:
ja_jp: `quarkus.oidc.authentication.user-info-required` は、次のいずれかの条件が満たされた場合に自動的に有効になります。
